performance/reports/runs/posts-2026-08-11T12-05-00/summary.txt
     ✓ login 200
     ✓ post list 200
     ✓ post detail 200
     ✓ post search 200
     ✓ post create 2xx
     ✓ post update 200
     ✓ post delete 200

   ✓ checks.........................: 100.00% ✓ 549      ✗ 0   
     data_received..................: 664 kB  9.8 kB/s
     data_sent......................: 219 kB  3.2 kB/s
     http_req_blocked...............: avg=86.36µs  min=1µs     med=10µs     max=6.95ms   p(90)=28µs     p(95)=147.99µs p(99)=1.67ms  
     http_req_connecting............: avg=19.74µs  min=0s      med=0s       max=645µs    p(90)=0s       p(95)=0s       p(99)=568.55µs
     http_req_duration..............: avg=32.31ms  min=2.28ms  med=10.42ms  max=472.53ms p(90)=45.05ms  p(95)=130.46ms p(99)=456.09ms
       { expected_response:true }...: avg=32.31ms  min=2.28ms  med=10.42ms  max=472.53ms p(90)=45.05ms  p(95)=130.46ms p(99)=456.09ms
     ✓ { feature:auth }.............: avg=417.42ms min=279.5ms med=450.72ms max=472.53ms p(90)=466.17ms p(95)=470.82ms p(99)=472.19ms
     ✓ { feature:board }............: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:chat }.............: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:comment }..........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:friend }...........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:hot }..............: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:mypage }...........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:notification }.....: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:post }.............: avg=17.75ms  min=2.28ms  med=10.14ms  max=232.81ms p(90)=28.94ms  p(95)=51.3ms   p(99)=153.08ms
     ✓ { feature:reaction }.........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:school }...........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:scrap }............: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:timetable }........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { op:auth }..................: avg=417.42ms min=279.5ms med=450.72ms max=472.53ms p(90)=466.17ms p(95)=470.82ms p(99)=472.19ms
     ✓ { op:read }..................: avg=18.02ms  min=2.28ms  med=9.93ms   max=232.81ms p(90)=30.71ms  p(95)=59.69ms  p(99)=158.48ms
     ✓ { op:write }.................: avg=13.7ms   min=4.66ms  med=12.6ms   max=43.97ms  p(90)=20.65ms  p(95)=22.96ms  p(99)=38.06ms 
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 549 
     http_req_receiving.............: avg=188.87µs min=21µs    med=115µs    max=3.76ms   p(90)=293µs    p(95)=519.39µs p(99)=1.54ms  
     http_req_sending...............: avg=45.55µs  min=5µs     med=28µs     max=1.89ms   p(90)=69µs     p(95)=91.79µs  p(99)=210.59µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=32.07ms  min=2.19ms  med=10.25ms  max=472.49ms p(90)=44.9ms   p(95)=130.29ms p(99)=455.96ms
     http_reqs......................: 549     8.105944/s
     iteration_duration.............: avg=9.08s    min=4.22s   med=8.87s    max=16.04s   p(90)=12.74s   p(95)=14.23s   p(99)=15.63s  
     iterations.....................: 140     2.067089/s
     vus............................: 2       min=2      max=20
     vus_max........................: 20      min=20     max=20